facedetection_webapp/app/controllers/images_controller.rb

SELECT `images`.* FROM `images`
---
  def index
    @images = Image.all

INSERT INTO `images` (`name`, `width`, `height`, `x_position`, `y_position`, `created_at`, `updated_at`) VALUES ('MyString', 1, 1, 1, 1, '2019-05-10 06:28:35', '2019-05-10 06:28:35')
---
  def create
    # require 'net/http'
    # require 'json'
    # require 'uri'
    # require 'mini_magick'

    @image = Image.new(image_params)

    respond_to do |format|
      if @image.save

DELETE FROM `images` WHERE `images`.`id` = 980190962
---
  def destroy
    @image.destroy

SELECT  `images`.* FROM `images` WHERE `images`.`id` = 980190962 LIMIT 1
---
    def set_image
      @image = Image.find(params[:id])